{"format": "graph-model", "generatedBy": "2.6.1", "convertedBy": "TensorFlow.js Converter v3.11.0", "signature": {"inputs": {"Y": {"name": "Y:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "X": {"name": "X:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "3"}]}}}, "outputs": {"outputs": {"name": "rnn/transpose_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "Y", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn/TensorArrayStack/range/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArrayStack/range/delta", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn/BasicLSTMCellZeroState/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn/BasicLSTMCellZeroState/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/BasicLSTMCellZeroState/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn/BasicLSTMCellZeroState/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "rnn/TensorArrayUnstack/range/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/TensorArrayUnstack/range/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/BasicLSTMCellZeroState/ExpandDims_2/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/BasicLSTMCellZeroState/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/BasicLSTMCellZeroState/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/BasicLSTMCellZeroState/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn/basic_lstm_cell/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "12"}]}}}}}, {"name": "rnn/basic_lstm_cell/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}}}, {"name": "rnn/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/while/iteration_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/Maximum/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/concat_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "rnn/while/basic_lstm_cell/MatMul/Enter", "op": "Enter", "input": ["rnn/basic_lstm_cell/kernel"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"name": "rnn/while/basic_lstm_cell/BiasAdd/Enter", "op": "Enter", "input": ["rnn/basic_lstm_cell/bias"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Enter_1", "op": "Enter", "input": ["rnn/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "parallel_iterations": {"i": "32"}}}, {"name": "rnn/while/Enter", "op": "Enter", "input": ["rnn/while/iteration_counter"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "rnn/transpose", "op": "Transpose", "input": ["X", "rnn/concat"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/rnn/basic_lstm_cell/kernel_enter", "op": "Const", "input": ["^rnn/while/basic_lstm_cell/MatMul/Enter"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/rnn/basic_lstm_cell/bias_enter", "op": "Const", "input": ["^rnn/while/basic_lstm_cell/BiasAdd/Enter"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}}}, {"name": "rnn/while/Merge_1", "op": "Merge", "input": ["rnn/while/Enter_1", "rnn/while/NextIteration_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn/while/Merge", "op": "Merge", "input": ["rnn/while/Enter", "rnn/while/NextIteration"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArrayUnstack/Shape", "op": "Shape", "input": ["rnn/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/Shape", "op": "Shape", "input": ["rnn/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/Shape_1", "op": "Shape", "input": ["rnn/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArrayUnstack/strided_slice", "op": "StridedSlice", "input": ["rnn/TensorArrayUnstack/Shape", "rnn/TensorArrayUnstack/strided_slice/stack", "rnn/TensorArrayUnstack/strided_slice/stack_1", "rnn/TensorArrayUnstack/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "rnn/strided_slice", "op": "StridedSlice", "input": ["rnn/Shape", "rnn/strided_slice/stack", "rnn/strided_slice/stack_1", "rnn/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "rnn/strided_slice_1", "op": "StridedSlice", "input": ["rnn/Shape_1", "rnn/strided_slice_1/stack", "rnn/strided_slice_1/stack_1", "rnn/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "rnn/TensorArrayUnstack/range", "op": "Range", "input": ["rnn/TensorArrayUnstack/range/start", "rnn/TensorArrayUnstack/strided_slice", "rnn/TensorArrayUnstack/range/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "rnn/BasicLSTMCellZeroState/ExpandDims", "op": "ExpandDims", "input": ["rnn/strided_slice", "rnn/BasicLSTMCellZeroState/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn/BasicLSTMCellZeroState/ExpandDims_2", "op": "ExpandDims", "input": ["rnn/strided_slice", "rnn/BasicLSTMCellZeroState/ExpandDims_2/dim"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArrayStack/range", "op": "Range", "input": ["rnn/TensorArrayStack/range/start", "rnn/strided_slice_1", "rnn/TensorArrayStack/range/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArray", "op": "TensorArrayV3", "input": ["rnn/strided_slice_1"], "attr": {"clear_after_read": {"b": true}, "tensor_array_name": {"s": "cm5uL2R5bmFtaWNfcm5uL291dHB1dF8w"}, "dynamic_size": {"b": false}, "dtype": {"type": "DT_FLOAT"}, "element_shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "identical_element_shapes": {"b": true}}}, {"name": "rnn/TensorArray_1", "op": "TensorArrayV3", "input": ["rnn/strided_slice_1"], "attr": {"identical_element_shapes": {"b": true}, "element_shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "tensor_array_name": {"s": "cm5uL2R5bmFtaWNfcm5uL2lucHV0XzA="}, "dynamic_size": {"b": false}, "clear_after_read": {"b": true}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Less/Enter", "op": "Enter", "input": ["rnn/strided_slice_1"], "attr": {"frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}}}, {"name": "rnn/Maximum", "op": "Maximum", "input": ["rnn/Maximum/x", "rnn/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/BasicLSTMCellZeroState/concat", "op": "ConcatV2", "input": ["rnn/BasicLSTMCellZeroState/ExpandDims", "rnn/BasicLSTMCellZeroState/Const", "rnn/BasicLSTMCellZeroState/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "rnn/BasicLSTMCellZeroState/concat_1", "op": "ConcatV2", "input": ["rnn/BasicLSTMCellZeroState/ExpandDims_2", "rnn/BasicLSTMCellZeroState/Const_2", "rnn/BasicLSTMCellZeroState/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn/while/TensorArrayWrite/TensorArrayWriteV3/Enter", "op": "Enter", "input": ["rnn/TensorArray"], "attr": {"is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "T": {"type": "DT_RESOURCE"}}}, {"name": "rnn/while/Enter_2", "op": "Enter", "input": ["rnn/TensorArray:1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/TensorArrayReadV3/Enter", "op": "Enter", "input": ["rnn/TensorArray_1"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_RESOURCE"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}}}, {"name": "rnn/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3", "op": "TensorArrayScatterV3", "input": ["rnn/TensorArray_1", "rnn/TensorArrayUnstack/range", "rnn/transpose", "rnn/TensorArray_1:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Less", "op": "Less", "input": ["rnn/while/Merge", "rnn/while/Less/Enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/Minimum", "op": "Minimum", "input": ["rnn/strided_slice_1", "rnn/Maximum"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/BasicLSTMCellZeroState/zeros", "op": "Fill", "input": ["rnn/BasicLSTMCellZeroState/concat", "rnn/BasicLSTMCellZeroState/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "rnn/BasicLSTMCellZeroState/zeros_1", "op": "Fill", "input": ["rnn/BasicLSTMCellZeroState/concat_1", "rnn/BasicLSTMCellZeroState/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Merge_2", "op": "Merge", "input": ["rnn/while/Enter_2", "rnn/while/NextIteration_2"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/TensorArrayReadV3/Enter_1", "op": "Enter", "input": ["rnn/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"], "attr": {"is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Less_1/Enter", "op": "Enter", "input": ["rnn/Minimum"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}}}, {"name": "rnn/while/Enter_3", "op": "Enter", "input": ["rnn/BasicLSTMCellZeroState/zeros"], "attr": {"frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Enter_4", "op": "Enter", "input": ["rnn/BasicLSTMCellZeroState/zeros_1"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}}}, {"name": "rnn/while/Less_1", "op": "Less", "input": ["rnn/while/Merge_1", "rnn/while/Less_1/Enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/Merge_3", "op": "Merge", "input": ["rnn/while/Enter_3", "rnn/while/NextIteration_3"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "rnn/while/Merge_4", "op": "Merge", "input": ["rnn/while/Enter_4", "rnn/while/NextIteration_4"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/LogicalAnd", "op": "LogicalAnd", "input": ["rnn/while/Less", "rnn/while/Less_1"]}, {"name": "rnn/while/LoopCond", "op": "LoopCond", "input": ["rnn/while/LogicalAnd"]}, {"name": "rnn/while/Switch_3", "op": "Switch", "input": ["rnn/while/Merge_3", "rnn/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Switch_4", "op": "Switch", "input": ["rnn/while/Merge_4", "rnn/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Switch_1", "op": "Switch", "input": ["rnn/while/Merge_1", "rnn/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/Switch", "op": "Switch", "input": ["rnn/while/Merge", "rnn/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/Switch_2", "op": "Switch", "input": ["rnn/while/Merge_2", "rnn/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/TensorArrayReadV3", "op": "TensorArrayReadV3", "input": ["rnn/while/TensorArrayReadV3/Enter", "rnn/while/Switch_1:1", "rnn/while/TensorArrayReadV3/Enter_1"], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Identity", "op": "Identity", "input": ["rnn/while/Switch:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/Exit_2", "op": "Exit", "input": ["rnn/while/Switch_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Const_1", "op": "Const", "input": ["^rnn/while/Identity"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "rnn/while/basic_lstm_cell/Const", "op": "Const", "input": ["^rnn/while/Identity"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/while/basic_lstm_cell/concat/axis", "op": "Const", "input": ["^rnn/while/Identity"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn/while/add/y", "op": "Const", "input": ["^rnn/while/Identity"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn/while/add_1/y", "op": "Const", "input": ["^rnn/while/Identity"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn/TensorArrayStack/TensorArrayGatherV3", "op": "TensorArrayGatherV3", "input": ["rnn/TensorArray", "rnn/TensorArrayStack/range", "rnn/while/Exit_2"], "attr": {"element_shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/concat", "op": "ConcatV2", "input": ["rnn/while/TensorArrayReadV3", "rnn/while/Switch_4:1", "rnn/while/basic_lstm_cell/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/add", "op": "AddV2", "input": ["rnn/while/Identity", "rnn/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/add_1", "op": "AddV2", "input": ["rnn/while/Switch_1:1", "rnn/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/transpose_1", "op": "Transpose", "input": ["rnn/TensorArrayStack/TensorArrayGatherV3", "rnn/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "rnn/while/basic_lstm_cell/BiasAdd", "op": "_FusedMatMul", "input": ["rnn/while/basic_lstm_cell/concat", "ConstantFolding/rnn/basic_lstm_cell/kernel_enter", "ConstantFolding/rnn/basic_lstm_cell/bias_enter"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "rnn/while/NextIteration", "op": "NextIteration", "input": ["rnn/while/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/NextIteration_1", "op": "NextIteration", "input": ["rnn/while/add_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/basic_lstm_cell/split", "op": "Split", "input": ["rnn/while/basic_lstm_cell/Const", "rnn/while/basic_lstm_cell/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "rnn/while/basic_lstm_cell/Sigmoid_1", "op": "Sigmoid", "input": ["rnn/while/basic_lstm_cell/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Tanh", "op": "Tanh", "input": ["rnn/while/basic_lstm_cell/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Add", "op": "AddV2", "input": ["rnn/while/basic_lstm_cell/split:2", "rnn/while/basic_lstm_cell/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Sigmoid_2", "op": "Sigmoid", "input": ["rnn/while/basic_lstm_cell/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Mul_1", "op": "Mul", "input": ["rnn/while/basic_lstm_cell/Sigmoid_1", "rnn/while/basic_lstm_cell/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Sigmoid", "op": "Sigmoid", "input": ["rnn/while/basic_lstm_cell/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Mul", "op": "Mul", "input": ["rnn/while/Switch_3:1", "rnn/while/basic_lstm_cell/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Add_1", "op": "AddV2", "input": ["rnn/while/basic_lstm_cell/Mul", "rnn/while/basic_lstm_cell/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/NextIteration_3", "op": "NextIteration", "input": ["rnn/while/basic_lstm_cell/Add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Tanh_1", "op": "Tanh", "input": ["rnn/while/basic_lstm_cell/Add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Mul_2", "op": "Mul", "input": ["rnn/while/basic_lstm_cell/Tanh_1", "rnn/while/basic_lstm_cell/Sigmoid_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/NextIteration_4", "op": "NextIteration", "input": ["rnn/while/basic_lstm_cell/Mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/TensorArrayWrite/TensorArrayWriteV3", "op": "TensorArrayWriteV3", "input": ["rnn/while/TensorArrayWrite/TensorArrayWriteV3/Enter", "rnn/while/Switch_1:1", "rnn/while/basic_lstm_cell/Mul_2", "rnn/while/Switch_2:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/NextIteration_2", "op": "NextIteration", "input": ["rnn/while/TensorArrayWrite/TensorArrayWriteV3"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "rnn/TensorArrayStack/range/start", "shape": [], "dtype": "int32"}, {"name": "rnn/TensorArrayStack/range/delta", "shape": [], "dtype": "int32"}, {"name": "rnn/BasicLSTMCellZeroState/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "rnn/BasicLSTMCellZeroState/Const", "shape": [1], "dtype": "int32"}, {"name": "rnn/BasicLSTMCellZeroState/concat/axis", "shape": [], "dtype": "int32"}, {"name": "rnn/BasicLSTMCellZeroState/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "rnn/TensorArrayUnstack/range/start", "shape": [], "dtype": "int32"}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "rnn/TensorArrayUnstack/range/delta", "shape": [], "dtype": "int32"}, {"name": "rnn/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "rnn/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "rnn/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "rnn/BasicLSTMCellZeroState/ExpandDims_2/dim", "shape": [], "dtype": "int32"}, {"name": "rnn/BasicLSTMCellZeroState/Const_2", "shape": [1], "dtype": "int32"}, {"name": "rnn/BasicLSTMCellZeroState/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "rnn/BasicLSTMCellZeroState/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "rnn/basic_lstm_cell/kernel", "shape": [6, 12], "dtype": "float32"}, {"name": "rnn/basic_lstm_cell/bias", "shape": [12], "dtype": "float32"}, {"name": "rnn/time", "shape": [], "dtype": "int32"}, {"name": "rnn/while/iteration_counter", "shape": [], "dtype": "int32"}, {"name": "rnn/Maximum/x", "shape": [], "dtype": "int32"}, {"name": "rnn/concat", "shape": [3], "dtype": "int32"}, {"name": "rnn/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "rnn/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "rnn/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "rnn/concat_2", "shape": [3], "dtype": "int32"}, {"name": "ConstantFolding/rnn/basic_lstm_cell/kernel_enter", "shape": [6, 12], "dtype": "float32"}, {"name": "ConstantFolding/rnn/basic_lstm_cell/bias_enter", "shape": [12], "dtype": "float32"}, {"name": "rnn/while/basic_lstm_cell/Const_1", "shape": [], "dtype": "float32"}, {"name": "rnn/while/basic_lstm_cell/Const", "shape": [], "dtype": "int32"}, {"name": "rnn/while/basic_lstm_cell/concat/axis", "shape": [], "dtype": "int32"}, {"name": "rnn/while/add/y", "shape": [], "dtype": "int32"}, {"name": "rnn/while/add_1/y", "shape": [], "dtype": "int32"}]}]}